; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared1)
	(have_image Planet9 spectrograph0)
	(have_image Star10 infrared1)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Star13 spectrograph0)
	(have_image Planet14 infrared1)
	(have_image Planet15 infrared1)
	(have_image Star16 spectrograph0)
	(have_image Star17 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation2 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 planet14 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet14)
   goals met: 0 of 12
5. (take_image satellite0 planet14 instrument1 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon7 instrument1 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon12 instrument1 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 3 of 12
10. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 3 of 12
11. (take_image satellite0 planet15 instrument1 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 4 of 12
12. (turn_to satellite0 planet6 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet6)
   goals met: 4 of 12
13. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 5 of 12
14. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 5 of 12
15. (take_image satellite0 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 6 of 12
16. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 12
17. (take_image satellite0 star10 instrument1 infrared1)
   added: (have_image star10 infrared1)
   goals met: 7 of 12
18. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 7 of 12
19. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 8 of 12
20. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 8 of 12
21. (take_image satellite0 star13 instrument1 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 9 of 12
22. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 9 of 12
23. (take_image satellite0 star16 instrument1 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 10 of 12
24. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 10 of 12
25. (take_image satellite0 star17 instrument1 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 11 of 12
26. (turn_to satellite0 star8 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star8)
   goals met: 11 of 12
27. (take_image satellite0 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 12 of 12
